{
	"INTRODUCTION": "INTRODUCTIE",
	"PORTFOLIO": "PORTFOLIO",
	"SKILLS": "VAARDIGHEDEN",
	"CONTACT": "CONTACT",

	"I offer application development for Android mobile devices stemming from firm experience in Java, Html and graphics. Front end experience with Java ,HTML5, Bootstrap. Backend experience with Spring-Boot, Mongo DB, MySQL and App Engine. I describe myself as an allrounder who feels equally at home working on graphics and mockups or at the other hand streamlining https nodes or making database queries. Keywords compliancy, creativity and perserverance.": "Applicatieontwikkeling voor Android mobiele toestellen vanuit stevige ervaring in Java, Html en graphics. Front end ervaring met Java, HTML5, Bootstrap. Backend ervaring met Spring-Boot, Mongo-DB, MySQL en App Engine. Ik beschrijf mezelf als een allrounder die zich net zo makkelijk thuis voelt in het bewerken van graphics of het maken van mockups, of anderzijds het stroomlijnen van https eindpunten of het maken van database queries. Sleutelwoorden zijn Meegaandheid, Creativiteit en Doorzettingsvermogen.",
  "Introduction": "Introductie",
  "Tafeltrainer is an educational web application where children can practise the times tables. At the same time Teachers and Parents are being held informed about the pupils progress. The app can be visited at": "Tafeltrainer is een educatieve web-applicatie waarin kinderen de tafels kunnen oefenen. Tegelijkertijd kunnen leerkrachten en ouders de vinger aan de pols houden omtrent de verrichtingen van de leerling. De app is online op ",
  "The app strives to motivate children to practise by a system with virtual money and goods they can buy in a little shop. Money can be earned by practising.": "De app motiveert kinderen door ze te laten oefenen met een systeem van virtueel geld en goederen die ze kunnen kopen in een winkeltje. Geld wordt verdiend door te oefenen.",
  "In the shop all kinds of products can be bought like animals, funny pictures, football players and so on. But when all the money is spent the child has to go to practise again!": "In het winkeltje kunnen allerlei producten worden gekocht zoals dieren, grappige plaatjes, voetballers en dergelijke. Maar wanneer al het geld is uitgegeven moet er weer geoefend worden!",
  "The child has access to a personal wallet and a results page.": "Het kind heeft toegang tot een portemonnee en een persoonlijke resultatenpagina.",
  "The app distinguishes two types of motivation: money and achievement. The latter category can earn prizes, while the money motivated pupils will go for the items in the shop.": "De app maakt onderscheid tussen twee soorten motivatie: geld en prestatie. Bij deze laatste worden prijzen uitgereikt bij bijv. het beheersen van een bepaalde tafel. De door geld gemotiveerde kinderen zullen worden gemotiveerd door de items in het winkeltje.",
  "For parents and teachers detailed insights are available by visiting the administration console. Since teachers face large time constraints they can be supplied with result lists by email.": "Voor ouders en leerkrachten zijn gedetailleerde inzichten beschikbaar in het administratie console. Aangezien leerkrachten vaak grote tijdsdruk ervaren kunnen zij ervoor kiezen resultaatlijsten per email toegestuurd te krijgen.",
  "An Android Application that helps a radiology treatment center to regulate the queue of waiting patients. The app optimizes the occupation rate for the machines at the same time trying to minimize the burden of long waiting times.": "Een Android applicatie die een behandelcentrum voor Radiologie helpt om de wachtrij met patienten te reguleren. De app optimaliseert de bezettingsgraad van de machines en minimaliseert de wachttijden.",
  "The application consists of three parts: The first part is an app that patients use to enter or leave in the queue of people that are waiting for treatment.An estimate of the expected waiting time will be displayed. The patient will get notifications when it is her turn or when it is appointment day.": "De applicatie bestaat uit drie delen: Het eerste deel is een app die patienten gebruiken om in of uit de wachtrij voor mensen die wachten op behandeling te stappen. Ze krijgen een schatting van de wachttijd te zien. De patient krijgt notificaties wanneer hij aan de beurt is of wanneer het de dag van de afspraak is.",
  "The second part is an app that administrators in the hospitals use. They will see the queue of waiting people and they can manipulate this queue, according to the situation at that moment. They have access to the general patient list and can make appointments. The amount of treatment machines and the average treatment time can be changed in a special settings screen.": "Het tweede deel van de applicatie is een app die gebruikt wordt door het personeel van het behandelcentrum. Zij kunnen de wachtrij overzien met de app en kunnen de rij aanpassen naar gelang de situatie op dat moment. Zij hebben toegang tot de algemene patientenlijst en kunnen afspraken maken. De hoeveelheid behandelmachines en de gemiddelde behandeltijd kunnen worden gewijzigd in een instellingenscherm.",
  "The third part of the application connects patient and admin app; it maintains security, it structures the waiting queue, notifies admins when a patient has logged in, notifies patients about their waiting times, keeps track of appointments, etc. This part resides on a server in the cloud.": "Het derde deel van de applicatie verbindt de patienten en personeels app. Het handhaaft de veiligheid, het structureert de wachtrij, geeft notificaties wanneer mensen zijn ingelogd, notificaties over wachttijden, houdt de afspraken bij, en dergelijke. Dit gedeelte van de app bevindt zich op een server in de cloud.",
  "An app to navigate through the ancient center of Gouda Netherlands. It will keep track of the location of the user, at the same time displaying a suggested route, displaying pictures and information about interesting features.": "Een app om door het antieke stadscentrum van Gouda te navigeren. Het houdt de locatie van de gebruiker bij, tegelijkertijd toont het een wandelroute, plaatjes en informatie over interessante aspecten.",
  "The app is basically displaying a map with some helpful features laid over it. People are on their way so this app is kept as simple as possible so that it can be used without studying all of its workings.": "De app toont een basis kaart met een aantal behulpzame onderdelen daar bovenop. Mensen zijn onderweg, daarom is deze app zo simpel mogelijk gehouden. Mensen willen de app meteen gebruiken zonder meteen al haar werkingen te moeten bestuderen.",
  "Overlays with text and pictures are shown and their visibility can be toggled on or off with the buttons. The arrow buttons control which marker on the route is active. Currently translations in Dutch, English and Spanish.": "Overlays met tekst en plaatjes worden getoond en hun zichtbaarheid kan aan of uit worden gezet met behulp van de grijze knoppen. De pijlknoppen controleren welke marker van de route actief is. Momenteel vertalingen in Nederlands, Engels en Spaans.",
  "Groupmaker is an application for teachers. In modern teaching practice classes very often have to be split up in order to complete an assignment. The learning experience is enhanced through the cooperation process. However class management is more difficult.The group can easily be split up in duos, triplets or how many groups there are needed.": "Groepsmaker is een applicatie voor leerkrachten. In de moderne onderwijspraktijk moeten klassen vaak worden opgesplitst in subgroepen om een opdracht te kunnen doen. Doordat er wordt samengewerkt en uitgewisseld wordt het leerresultaat verbeterd. Maar klassenmanagement wordt moeilijker. De app helpt de leerkracht met dit probleem.",
  "Very often the teacher wants to place people together, or apart from eachother. In the app the red colors will be placed in different groups, the green colors in the same subgroup. The app will make a division based on the given conditions.": "Vaak wil de leerkracht specifieke leerlingen samen of juist uit elkaar plaatsen. In de app worden de rode kleuren uit elkaar geplaatst, en de groene kleuren bij elkaar. Op basis van deze randvoorwaarden maakt de app een verdeling.",
  "Sometimes a group leader wants to have people distributed evenly. Like for example all the girls in a certain group. Results can be transmitted to the digital whiteboard, or to collegues via sms or email;": "Soms wil een leerkracht mensen evenwichtig over alle groepen verdeeld hebben. Zoals bijv alle meisjes in een groep. De app voorziet in deze mogelijkheid. Resultaten kunnen worden gecommuniceerd via whiteboard, sms of e-mail.",
  "Skills": "Vaardigheden",
  "Who is Apstraction?": "Wie is Apstraction?",
  "Coming from a background in arts and education I find making software an art and a craft. I have a weakness for old computer games like Discworld, Zelda and Psychonauts. Currently busy with courses on Angular Js and Algorithms, and looking for other opportunities to expand my skills. I live in Gouda Netherlands together with a beautiful wife, two cats and a dachshund.": "Vanuit een achtergrond in kunst en educatie vind ik software intwikkelen een kunst en een ambacht. Heb een zwakte voor oude computergames zoals Discworld, Zelda en Psychonauts. Tegenwoordig bezig met cursussen over Angular Js en Algoritmes, en aan het uitkijken naar andere mogelijkheden om mijn vaardigheden uit te breiden. Ik woon in Gouda Nederland samen met mijn mooie vrouw, twee katten, en een tekkel.",
  "An Android Application that promotes the museum of Modern Art, letting the user play with Broadway Boogie Woogie style elements, making use of Androids animation api. The app is an assignment of <a href=\"https://www.coursera.org/specializations/mobile-cloud-computing\" target=\"_blank\">an online Mooc</a> The app needs to be expanded with more ways to make a nice painting, like rotating and enlarging images, or letting it behave like a screensaver.": "Android app die het MOMA museum van moderne kunst propageert. Het laat de gebruiker spelen met Broadway Boogie Woogie achtige elementen, gebruik makend van Androids animatie-api. De app moet uitgebreid worden met meer manieren om een leuk \"schilderij\" te maken, zoals rotatie en schaalverandering van de figuren, zodat het een soort screensaver wordt.",
  "The weather is surely in the top 5 of human interests. This app fetches weather data from the OpenWeather api and displays them in a nice way. The idea is to have several 'weathers' displayed in a personalized way. Like for example a mother who wants to know the weather in the home towns of her children.": "In de top 5 human interest bevindt zich zeker het weer. De app haalt weergegevens op van de OpenWeather api en geeft ze weer op een aantrekkelijke wijze. Het idee is om het weer uit verschillende steden gepersonaliseerd weer te geven. Bijvoorbeeld een moeder die het weer in de thuissteden van haar kinderen wil weten, of iemand die veel reist.",
  "This app lets people take a daily selfie and stores it on the local system. A logical expansion here is to store the selfies in the cloud, so that the user keeps his collection when he changes his device. On the user side a search function would be necessary and some nice opportunities to edit selfies, add comments and sharing opportunities.": "Deze app nodigt mensen uit een dagelijkse selfie te nemen om op de vaste schijf op te slaan. Een logische uitbreiding hier is om de selfies in de cloud op te slaan, zodat de gebruiker zijn fotos nog heeft wanneer hij van apparaat wisselt. Ook is een zoekfunctie noodzakelijk bij een dergelijk programma, alsmede sociale en artistieke opties.",
  "": "",
  "": "",
  "": "",
	"Localizing done!": "Lokalisierung fertig!"
}